### Decision Tree

#### Build Decision Tree on Titanic Dataset (**Join the Kaggle Competition!**)

In [2]:
# Import useful libararies used for data management
import numpy as np
import pandas as pd

In [3]:
# load training dataset 'titanic_train.csv' for titanic case, using 'PassengerId' as index column

train = pd.read_csv('titanic_train.csv', index_col='PassengerId')

In [4]:
# load test dataset 'titanic_test.csv' for titanic case, using 'PassengerId' as index column
test = pd.read_csv('titanic_test.csv', index_col='PassengerId')

#### Preprocessing on Training Set and Test Set

In [5]:
# get the types of features for training set (pay attension to attributes with missing values)

train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [6]:
# On training set, replace missing values in 'Age' with mean (numeric variables) of training set
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

train['Age'].fillna(train['Age'].mean(),inplace=True)

In [7]:
# On training set, replace missing values in ‘Embarked’ with the most frequent value (mode) of training set
train['Embarked'].fillna(train['Embarked'].mode(),inplace=True)

In [8]:
# Delete the column 'Cabin' from training set
train = train.drop(columns='Cabin')

In [9]:
# check if the training data set cleaned or not
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 76.6+ KB

**Now, we will do preprocessing on test set. Note that when handling the missing values on test set, we should use most frequent value or mean value of the training set for replacement.**

In [10]:
# get the types of features for test set (pay attension to attributes with missing values)

test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 35.9+ KB

In [11]:
# Calculate the mean in the 'Age' column in trainning data set
Age_mean = train['Age'].mean()
# On test set, replace missing values in 'Age' with mean of training set
test['Age'].fillna(Age_mean,inplace=True)
print(Age_mean)

29.699117647058763

In [12]:
# Find out the mean in 'Fare' in training set
Fare_mean = train['Fare'].mean()
# On test set, replace missing values in 'Fare' with mean of training set
test['Fare'].fillna(Fare_mean,inplace=True)
print(Fare_mean)

32.2042079685746

In [13]:
# Delete the column 'Cabin' from test set

test = test.drop(columns='Cabin')

**Now, we will do one-hot-encoding on categorical variables. Please DO NOT drop the first dummy! When we process training data and test data separately, the first dummy may not be always the same. Please generate all the dummy variables first and manually drop the same dummy for training and test afterwards (so that training and test data would have the same set of dummy variables.**

In [15]:
# On training set, create dummy variables for categorical feature 'Sex', using 'Sex' as prefix, and DO NOT drop the first dummy
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html

train = pd.get_dummies(train, columns=['Sex'], prefix=['Sex'], drop_first=False)

In [16]:
# On test set, create dummy variables for categorical feature 'Sex', using 'Sex' as prefix, and DO NOT drop the first dummy
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html
test = pd.get_dummies(test, columns=['Sex'], prefix=['Sex'], drop_first=False)

In [17]:
# Delete the column 'Sex_female' from training set

train = train.drop(columns='Sex_female')

In [19]:
# Check if the 'Sex_female' column removed from train dataframe 
train.head()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_male
PassengerId,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C,0
3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,S,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,S,0
5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,S,1

In [18]:
# Delete the column 'Sex_female' from test set

test = test.drop(columns='Sex_female')

In [21]:
# Check if the 'Sex_female' column removed from test dataframe 
test.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_male
PassengerId,,,,,,,,,
892,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,Q,1
893,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,S,0
894,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,Q,1
895,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,S,1
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,S,0

In [23]:
# On training set, create dummy variables for categorical feature 'Embarked', using 'Embarked' as prefix, and DO NOT drop the first dummy
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html

train = pd.get_dummies(train, columns=['Embarked'], prefix=['Embarked'], drop_first=False)

In [24]:
# Check if the dummy variables added in the dataframe
train.head()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,1,0,0,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,0,1,0,0
3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,0,0,0,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,0,0,0,1
5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,1,0,0,1

In [25]:
# On test set, create dummy variables for categorical feature 'Embarked', using 'Embarked' as prefix, and DO NOT drop the first dummy
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html
test = pd.get_dummies(test, columns=['Embarked'], prefix=['Embarked'], drop_first=False)

In [26]:
# Check if the dummy variables added in the dataframe
test.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,1,0,1,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,0,0,0,1
894,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,1,0,1,0
895,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,1,0,0,1
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,0,0,0,1

In [30]:
# Delete the column 'Embarked_C' from training set

train = train.drop(columns='Embarked_C')

KeyError: "['Embarked_C'] not found in axis"

In [28]:
# Delete the column 'Embarked_C' from test set
test = test.drop(columns='Embarked_C')

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,1,1,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,0,0,1
894,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,1,1,0
895,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,1,0,1
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,0,0,1

In [29]:
# Display the first 5 rows for training set

train.head()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,1,0,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,0,0,0
3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,0,0,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,0,0,1
5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,1,0,1

In [31]:
# Display the first 5 rows for test set

test.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,1,1,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,0,0,1
894,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,1,1,0
895,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,1,0,1
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,0,0,1

### Model Building

- Recall the purpose of this Titanic Prediction Project
- What are your trying to predict? 
    - The 'Survived' value (target variable)
    
- What features/attributes are you going to use to help you doing the prediction? 
    - Pclass, SibSp, Parch, ...

In [32]:
# use 'Pclass','Age','SibSp','Parch','Fare','Sex_male','Embarked_Q','Embarked_S' as features
#** No need to fill in any command in this cell, but you need to execute this command. 

features = ['Pclass','Age','SibSp','Parch','Fare','Sex_male','Embarked_Q','Embarked_S']

In [34]:
# assign the target variable 'Survived'

target = ['Survived']
target

['Survived']

In [35]:
# Import Decision Tree Classifier from sklearn
from sklearn.tree import DecisionTreeClassifier

In [89]:
# Define model to be decision tree classifier; please try out different combinations of parameter values here
model_1 = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=None,
                               min_samples_split=2, min_samples_leaf=1, 
                               min_weight_fraction_leaf=0.0, max_features=None, 
                               random_state=None, max_leaf_nodes=None, min_impurity_decrease=0.0, 
                               class_weight=None, ccp_alpha=0.0)
# using default in model_1, we got a maximum depth of 22, in model 2, we can try max_depth = 20, and keeping 
# others the same with default
model_2 = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=20,
                               min_samples_split=2, min_samples_leaf=1)

# in model_3, we will cut the depth half of the original, max_depth =10
model_3 = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=10,
                               min_samples_split=2, min_samples_leaf=1)

# in model_4, we will try using 'entropy' as oour criterion
model_4 = DecisionTreeClassifier(criterion='entropy', splitter='best',max_depth=10,
                               min_samples_split=2, min_samples_leaf=1)

In [62]:
# assign values of independent variables and target variable of training set to X_train and y_train respectively.
#** No need to fill in any command in this cell, but you need to execute this command. 

X_train = train[features]
y_train = train[target]

In [66]:
# train model using training dataset

model_1.fit(X_train, y_train)

DecisionTreeClassifier()

In [76]:
# train model 2 using training dataset
model_2.fit(X_train, y_train)

DecisionTreeClassifier(max_depth=20)

In [81]:
# train model 3 using training dataset
model_3.fit(X_train, y_train)

DecisionTreeClassifier(max_depth=10)

In [90]:
# train model 4 using training dataset
model_4.fit(X_train, y_train)

DecisionTreeClassifier(criterion='entropy', max_depth=10)

In [77]:
# import libraries for visuaiization
#** No need to fill in any command in this cell, but you need to execute this command. 
from sklearn.tree import export_graphviz
from IPython.display import Image
import pydotplus
from sklearn import tree
import graphviz

In [68]:
# use export_graphviz to visualize the tree
#** No need to fill in any command in this cell, but you need to execute this command. 
dot_data = tree.export_graphviz(model_1, out_file=None, 
                      feature_names=features,  
                      class_names=['Did not survive', 'Survived'],
                      filled = True, rounded=True,  
                      special_characters=True)

graph = graphviz.Source(dot_data)  
graph.render("titanic_tree_1")

'titanic_tree_1.pdf'

In [79]:
# use export_graphviz to visualize the tree
#** No need to fill in any command in this cell, but you need to execute this command. 
dot_data = tree.export_graphviz(model_2, out_file=None, 
                      feature_names=features,  
                      class_names=['Did not survive', 'Survived'],
                      filled = True, rounded=True,  
                      special_characters=True)

graph = graphviz.Source(dot_data)  
graph.render("titanic_tree_2")

'titanic_tree_2.pdf'

In [82]:
# use export_graphviz to visualize the tree
#** No need to fill in any command in this cell, but you need to execute this command. 
dot_data = tree.export_graphviz(model_3, out_file=None, 
                      feature_names=features,  
                      class_names=['Did not survive', 'Survived'],
                      filled = True, rounded=True,  
                      special_characters=True)

graph = graphviz.Source(dot_data)  
graph.render("titanic_tree_3")

'titanic_tree_3.pdf'

In [91]:
# use export_graphviz to visualize the tree
#** No need to fill in any command in this cell, but you need to execute this command. 
dot_data = tree.export_graphviz(model_4, out_file=None, 
                      feature_names=features,  
                      class_names=['Did not survive', 'Survived'],
                      filled = True, rounded=True,  
                      special_characters=True)

graph = graphviz.Source(dot_data)  
graph.render("titanic_tree_4")

'titanic_tree_4.pdf'

### Model Testing

- We just build the very first tree using the default parameter settings, what would be the predicting result on testing dataset?

In [69]:
# assign values of independent variables of test set to X_test.
#** No need to fill in any command in this cell, but you need to execute this command. 

X_test = test[features]

In [70]:
# test model using test set

y_pred = model_1.predict(X_test)
y_pred

array([0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1])

In [71]:
# create a DataFrame with two columns: 'PassengerID' and 'Survived'
#** No need to fill in any command in this cell, but you need to execute this command. 
df = pd.DataFrame({'PassengerId': X_test.index, 'Survived': y_pred})

# write the results to csv file. 
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html
#** No need to fill in any command in this cell, but you need to execute this command. 
df.to_csv('results_1.csv', index=False)

#### You are ready to upload the 'results.csv' to Kaggle to join the competition!

# Model Evaluation

## Combinaton 1

model = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=None,
                               min_samples_split=2, min_samples_leaf=1)

This is the default setting giving by the Decision Tree Model, as a result the

In [72]:
# import library for cross validation 
from sklearn.model_selection import cross_val_score

In [73]:
# record the k-fold validation score from combination 1
score_1 = cross_val_score(model_1, X_test, y_pred, cv=10)
score_1

array([0.76190476, 0.76190476, 0.88095238, 0.73809524, 0.85714286,
       0.85714286, 0.9047619 , 0.83333333, 0.80487805, 0.75609756])

In [74]:
# taking average of the score for comparison
avg_score_1 = np.mean(score_1)
print(avg_score_1)

0.8156213704994192

## Combinaton 2

model_2 = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=20,
                               min_samples_split=2, min_samples_leaf=1)

In [85]:
# record the k-fold validation score from combination 2
score_2 = cross_val_score(model_2, X_test, y_pred, cv=10)
score_2

array([0.76190476, 0.80952381, 0.83333333, 0.73809524, 0.85714286,
       0.85714286, 0.88095238, 0.85714286, 0.80487805, 0.80487805])

In [86]:
# taking average of the score for comparison
avg_score_2 = np.mean(score_2)
print(avg_score_2)

0.8204994192799072

## Combinaton 3

model_3 = DecisionTreeClassifier(criterion='gini', splitter='best',max_depth=10,
                               min_samples_split=2, min_samples_leaf=1)

In [87]:
# record the k-fold validation score from combination 3
score_3 = cross_val_score(model_3, X_test, y_pred, cv=10)
score_3

array([0.78571429, 0.78571429, 0.83333333, 0.78571429, 0.85714286,
       0.85714286, 0.9047619 , 0.83333333, 0.7804878 , 0.80487805])

In [88]:
# taking average of the score for comparison
avg_score_3 = np.mean(score_3)
print(avg_score_3)

0.822822299651568

## Combinaton 4

model_4 = DecisionTreeClassifier(criterion='entropy', splitter='best',max_depth=10,
                               min_samples_split=2, min_samples_leaf=1)

In [92]:
# record the k-fold validation score from combination 3
score_4 = cross_val_score(model_4, X_test, y_pred, cv=10)
score_4

array([0.78571429, 0.80952381, 0.83333333, 0.78571429, 0.80952381,
       0.88095238, 0.88095238, 0.85714286, 0.82926829, 0.82926829])

In [93]:
# taking average of the score for comparison
avg_score_4 = np.mean(score_4)
print(avg_score_4)

0.8301393728222998

# Evaluation with ROC

In [ ]:
# Import libaries
from sklearn.metrics import roc_curve

# this is the array for true classes
y = np.array([1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0])

# this is the array for predicted probability of belonging to class 1
scores = np.array([0.9, 0.8, 0.7, 0.6, 0.55, 0.54, 0.53, 0.52, 0.51, 0.505, 0.4, 0.39, 0.38, 0.37, 0.36, 0.35, 0.34, 0.33, 0.30, 0.1])

# generate the ROC curve
# https://scikit-learn.org/stable/modules/generated/sklearn.metrics.roc_curve.html
fpr, tpr, thresholds = roc_curve(y, scores, pos_label=1)

#display the arrary of false positive rates
fpr